
# «Стиль для себя» с Татьяной
info_course_1 = """
В курсе "Стиль для себя" 8 занятий. Продолжительность курса 1 месяц. Уроки выходят два раза в неделю: понедельник и среда.
Уроки вы можете смотреть в любое удобное для вас время - в формате записанных видеозаписей.
На выполнение домашних заданий дается одна неделя. Все домашние задания проверяет лично Татьяна, она же дает обратную связь по домашним заданиям.

В курс входят следующие уроки: 
1. Основы базового гардероба. Введение.
2. Разбор гардероба. Учимся сами разбирать гардероб без потерь и правильно ходить по магазинам.
3. Типы фигур. Определяем тип фигуры. Учимся правильно подчеркивать достоинства фигуры. Визуальная коррекция фигуры.
4. Теория цвета. Контрастность внешности. Учимся подбирать цвета и сочетать их. Правила использования цветого круга.
5. Антитренды. Как выглядеть дорого без больших затрат. Где и что купить.
6. Стилистические приемы. Составление нестандартных комплектов. Подбор очков, шляп, ремней и других аксессуаров.
7. Тренды. История возникновения трендов. Грамотное внедрение трендов в гардероб. Ссылки на блогеров и модные сайты.
8. Макияж для себя. Основные правила повседневного макияжа от топ-визажиста города Екатеринбурга Владимира Перминова.

Будет общий чат с участницами и Татьяной. Будет закрытый аккаунт в инстаграм, где Татьяна будет проводить прямые эфиры. О прямых эфирах будет сообщаться в телеграм чате заранее)

Доступ к урокам 1 год, чтобы после завершения курса, вы могли в любой момент пересмотреть уроки)

*Стоимость пакета - 29 000 рублей.*
"""
# «Стиль для себя» с куратором
info_course_2 = """
В курсе "Стиль для себя" 8 занятий. Продолжительность курса 1 месяц. Уроки выходят два раза в неделю: понедельник и среда.
Уроки вы можете смотреть в любое удобное для вас время - в формате записанных видеозаписей.
На выполнение домашних заданий дается одна неделя. Все домашние задания проверяет куратор, он же дает обратную связь по домашним заданиям.

В курс входят следующие уроки: 
1.	Основы базового гардероба. Введение.
2.	Разбор гардероба. Учимся сами разбирать гардероб без потерь и правильно ходить по магазинам.
3.	Типы фигур. Определяем тип фигуры. Учимся правильно подчеркивать достоинства фигуры. Визуальная коррекция фигуры.
4.	Теория цвета. Контрастность внешности. Учимся подбирать цвета и сочетать их. Правила использования цветого круга.
5.	Антитренды. Как выглядеть дорого без больших затрат. Где и что купить.
6.	Стилистические приемы. Составление нестандартных комплектов. Подбор очков, шляп, ремней и других аксессуаров.
7.	Тренды. История возникновения трендов. Грамотное внедрение трендов в гардероб. Ссылки на блогеров и модные сайты.
8.	Макияж для себя. Основные правила повседневного макияжа от топ-визажиста города Екатеринбурга Владимира Перминова.

Будет общий чат с участницами и Татьяной. Будет закрытый аккаунт в инстаграм, где Татьяна будет проводить прямые эфиры. О прямых эфирах будет сообщаться в телеграм чате заранее.

Доступ к урокам 1 год, чтобы после завершения курса, вы могли в любой момент пересмотреть уроки.

*Стоимость пакета - 19 000 рублей.*
"""


# «Профессия-стилист» с Татьяной
info_course_3 = """
В курсе "Профессия-стилист" 18 занятий. Продолжительность курса 1,5 месяца. Уроки выходят три раза в неделю: понедельник,среда и пятница. 
Уроки вы можете смотреть в любое удобное для вас время - в формате записанных видеозаписей.
На выполнение домашних заданий дается одна неделя. Все домашние задания проверяет Татьяна, она же дает обратную связь по домашним заданиям.

В курс "Профессия-стилист" входят следующие уроки: 

1.	Введение и базовый гардероб.
2.	Первая встреча с клиентом. Чек-лист с вопросами для клиента. Как создать положительное впечатление. Формирование собственного перечня услуг стилиста, ценообразование.
3.	Разбор гардероба с клиентом. Алгоритм разбора гардероба. Отработка сомнений клиента. Грамотное распределение одежды в гардеробной.
4.	Типы фигур. Определяем тип фигуры. Учимся правильно подчеркивать достоинства фигуры. Визуальная коррекция фигуры.
5.	Теория цвета. Контрастность внешности. Подбор цвета и грамотное сочетание. Правила использования цветового круга.
6.	Стилистические приемы. Составление нестандартных комплектов. Подбор очков, шляп, ремней и других аксессуаров.
7.	Стили в одежде. Одни из популярных стилей в одежде и история их возникновения.
8.	Тренды. История возникновения трендов. Грамотное внедрение трендов в гардероб. Ссылки на блогеров и модные сайты.
9.	Insta под ключ. Основные правила ведения успешного инстаграма. Анализ статистики бизнес-аккаунта. Инструменты продвижения.
10.	Антитренды. Как выглядеть дорого без больших затрат. Где и что купить.
11.	Онлайн-разбор гардероба. Онлайн составление капсулы.

Лекции от приглашенных экспертов: 
12.	 Визуальный контент. Лекция от стилиста, финалиста битвы стилистов от журнала "Стольник" Оксаны Кузнецовой.
13.	Страхи. Лекция от психолога Олега Денисенко. "Проработка страхов и уверенности в себе".
14.	"Я - бренд". Лекция от публициста, основателя школы "Я-оратор" Ивана Возмилова.
15.	Публичное выступление в онлайне. Как коммуницировать с аудиторией в прямых эфирах, марафонах, курсах. Лекция от основателя школы "Я-оратор" Ивана Возмилова.
16.	Тайм-менеджмент. Как правильно планировать и управлять своим временем. Лекция от публициста Ивана Возмилова.
17.	Макияж для себя. Основные правила повседневного макияжа от топ-визажиста города Екатеринбурга Владимира Перминова.
18.	Мужской гардероб. Гид по мужскому гардеробу от Арсена Айрапетова - личного стилиста Филиппа Киркорова и Давида Манукяна (Дава).
 
Будет общий чат с участницами и Татьяной. Как показывает практика, чат очень активный, девушки общаются, знакомятся, спрашивают друг у друга советы по поводы вещей, делятся своим опытом.
Будет закрытый аккаунт в инстаграм, где Татьяна будет проводить прямые эфиры. О прямых эфирах будет сообщаться в телеграм чате заранее.
Доступ к урокам 1 год, чтобы после завершения курса, вы могли в любой момент пересмотреть уроки)

*Стоимость пакета - 39 000 рублей.*
"""
# «Профессия-стилист» с куратором
info_course_4 = """
В курсе "Профессия-стилист" 18 занятий. Продолжительность курса 1,5 месяца. Уроки выходят три раза в неделю: понедельник,среда и пятница. 
Уроки вы можете смотреть в любое удобное для вас время - в формате записанных видеозаписей.
На выполнение домашних заданий дается одна неделя. Все домашние задания проверяет куратор, он же дает обратную связь по домашним заданиям.

В курс "Профессия-стилист" входят следующие уроки: 
1.	Введение и базовый гардероб.
2.	Первая встреча с клиентом. Чек-лист с вопросами для клиента. Как создать положительное впечатление. Формирование собственного перечня услуг стилиста, ценообразование.
3.	Разбор гардероба с клиентом. Алгоритм разбора гардероба. Отработка сомнений клиента. Грамотное распределение одежды в гардеробной.
4.	Типы фигур. Определяем тип фигуры. Учимся правильно подчеркивать достоинства фигуры. Визуальная коррекция фигуры.
5.	Теория цвета. Контрастность внешности. Подбор цвета и грамотное сочетание. Правила использования цветового круга.
6.	Стилистические приемы. Составление нестандартных комплектов. Подбор очков, шляп, ремней и других аксессуаров.
7.	Стили в одежде. Одни из популярных стилей в одежде и история их возникновения.
8.	Тренды. История возникновения трендов. Грамотное внедрение трендов в гардероб. Ссылки на блогеров и модные сайты.
9.	Insta под ключ. Основные правила ведения успешного инстаграма. Анализ статистики бизнес-аккаунта. Инструменты продвижения.
10.	Антитренды. Как выглядеть дорого без больших затрат. Где и что купить.
11.	Онлайн-разбор гардероба. Онлайн составление капсулы.

Лекции от приглашенных экспертов: 
12.	 Визуальный контент. Лекция от стилиста, финалиста битвы стилистов от журнала "Стольник" Оксаны Кузнецовой.
13.	Страхи. Лекция от психолога Олега Денисенко. "Проработка страхов и уверенности в себе".
14.	"Я - бренд". Лекция от публициста, основателя школы "Я-оратор" Ивана Возмилова.
15.	Публичное выступление в онлайне. Как коммуницировать с аудиторией в прямых эфирах, марафонах, курсах. Лекция от основателя школы "Я-оратор" Ивана Возмилова.
16.	Тайм-менеджмент. Как правильно планировать и управлять своим временем. Лекция от публициста Ивана Возмилова.
17.	Макияж для себя. Основные правила повседневного макияжа от топ-визажиста города Екатеринбурга Владимира Перминова.
18.	Мужской гардероб. Гид по мужскому гардеробу от Арсена Айрапетова - личного стилиста Филиппа Киркорова и Давида Манукяна (Дава).
 
Будет общий чат с участницами и Татьяной. Как показывает практика, чат очень активный, девушки общаются, знакомятся, спрашивают друг у друга советы по поводы вещей, делятся своим опытом.
Будет закрытый аккаунт в инстаграм, где Татьяна будет проводить прямые эфиры. О прямых эфирах будет сообщаться в телеграмм чате заранее.
Доступ к урокам 1 год, чтобы после завершения курса, вы могли в любой момент пересмотреть уроки.

*Стоимость пакета - 29 000 рублей.*
"""

def getTextInfoCourse(text):
    if text == 'ℹ «Стиль для себя» с Татьяной':
        return info_course_1
    elif text == 'ℹ «Стиль для себя» с куратором':
        return info_course_2
    elif text == 'ℹ «Профессия-стилист» с Татьяной':
        return info_course_3
    elif text == 'ℹ «Профессия-стилист» с куратором':
        return info_course_4


#  Стоимость курса
#  «Стиль для себя» с Татьяной
coast_course_1 = """
«Стиль для себя» с Татьяной:
Стоимость - 29 000 рублей.
Возможна рассрочка (только для граждан РФ).

* Количество мест ограничено.
"""

#  «Стиль для себя» с куратором
coast_course_2 = """
«Стиль для себя» с куратором:
Стоимость – 19 000 рублей.
"""

#  «Профессия-стилист» с Татьяной
coast_course_3 = """
«Профессия-стилист» с Татьяной:
Стоимость -  39 000 рублей. 
Возможна рассрочка (только для граждан РФ).

*Количество мест ограничено.
"""

#  «Профессия-стилист» с куратором
coast_course_4 = """
«Профессия-стилист» с куратором: 
Стоимость – 29 000 рублей.
Возможна рассрочка (только для граждан РФ).
"""

def getTextInfoCoast(text):
    if text == '💰 «Стиль для себя» с Татьяной':
        return coast_course_1
    elif text == '💰 «Стиль для себя» с куратором':
        return coast_course_2
    elif text == '💰 «Профессия-стилист» с Татьяной':
        return coast_course_3
    elif text == '💰 «Профессия-стилист» с куратором':
        return coast_course_4


#  Оплатить курс
#  «Стиль для себя» с Татьяной
pay_course_1 = """
«Стиль для себя» с Татьяной: 
Стоимость – 29 000 рублей.
"""

#  «Стиль для себя» с куратором
pay_course_2 = """
«Стиль для себя» с куратором:
Стоимость – 19 000 рублей.
"""

#  «Профессия-стилист» с Татьяной
pay_course_3 = """
«Профессия-стилист» с Татьяной:
Стоимость – 39 000 рублей.
"""

#  «Профессия-стилист» с куратором
pay_course_4 = """
«Профессия-стилист» с куратором:
Стоимость – 29 000 рублей.
"""


def getTextInfoPay(text):
    if text == '💳 «Стиль для себя» с Татьяной':
        return pay_course_1
    elif text == '💳 «Стиль для себя» с куратором':
        return pay_course_2
    elif text == '💳 «Профессия-стилист» с Татьяной':
        return pay_course_3
    elif text == '💳 «Профессия-стилист» с куратором':
        return pay_course_4



#  Часто задаваемые вопросы
questions1 = """
Старт курса 1 ноября
"""
questions2 = """
•	Чем отличается курс «Стиль для себя» и «Профессия-стилист»?
Курс "Стиль для себя" подойдет вам, если вы хотите разобрать свой гардероб и научиться сочетать вещи для себя, 
курс "Профессия-стилист" подойдет вам, если вы планируете в будущем работать стилистом.

•	В чем отличие пакета с Татьяной и пакета с куратором?
Отличие пакетов в том, кто будет проверять ваше домашнее задание и, кто дает по нему обратную связь, куратор или Татьяна. 
Остальная информация в программе не отличается. 
Прямые эфиры в закрытом аккаунте и все уроки проводит лично Татьяна, не важно какой у вас курс, с куратором или с ней.
"""
questions3 = """
•	Какие возможны способы оплаты? 
Оплатить возможно 2-мя способами: банковской картой или paypal. Карта может быть любого банка, никаких комиссий не будет.
Также, есть возможность оплатить в рассрочку.

•	Как оформляется рассрочка?
Рассрочку можно оформить на 4 или 6 месяцев. Рассрочка без процентов, переплат и первого взноса. Первый взнос через месяц после подписания договора с банком. Рассрочка только для граждан РФ.

Менеджер вышлет ссылку на анкету, вы ее заполняете и отправляете заявку (все в электронном виде по одной ссылке)
Далее банк одобряет рассрочку и действия следующие:
1. если вы клиент банка Тинькофф и у вас есть их карта, то договор подписываете электронно, через смс.
2. если вы не клиент банка Тинькофф, то с вами связывается менеджер (обязательно нужно ответить на звонок), договаривается о встрече и приезжает к вам с договором, чтобы подписать.

•	Можно оплачивать курс частично?
Вы можете внести предоплату 1000 рублей, чтобы забронировать за собой место на курсе, дальше частично вносить оплату до 11 октября (до 11 октября должно быть внесено минимум 30% от суммы) и оставшуюся сумму нужно внести до 25 октября.
"""
questions4 = """
•	Сколько длится курс? 
Продолжительность курса «Стиль для себя» - 1 месяц (8 уроков)
Продолжительность курса «Профессия-стилист» - 1,5 месяца (18 уроков)

•	Сколько длится урок?
Продолжительность урока 20-30 минут. За это время Татьяна даёт всю нужную информацию, без воды

•	После курса выдают сертификат?
По окончанию обучения на почту вам будет выслан именной сертификат в электронном виде.
"""
questions5 = """
Выполнение домашних заданий - это практика, которая очень важна на курсе. 
Все домашние задания проверяет Татьяна или куратор, и, обязательно, дают обратную связь. 
Изучая одну теорию, не практикуясь, вы не добьетесь нужного вам результата. Мы очень советуем выполнять все домашние задания.
"""
questions6 = """
Уроки вы можете смотреть в любое удобное для вас время, т.к. они в записи.
На выполнение домашних заданий дается одна неделя. 
"""

def getTextInfoQuestions(text):
    if text == 'Когда начало курса?':
        return questions1
    elif text == 'Чем отличаются курсы?':
        return questions2
    elif text == 'Какие есть варианты оплаты?':
        return questions3
    elif text == 'Сколько идет курс и уроки?':
        return questions4
    elif text == 'Я могу не выполнять домашние задания?':
        return questions5
    elif text == 'Я уезжаю в отпуск, смогу смотреть уроки?':
        return questions6
    else:
        return "К сожалению, я не знаю как ответить на Ваш вопрос. " \
               "Выберите вопрос из меню или свяжитесь с менеджером."



text_start = """
Я чат-бот школы стиля by Teyla. Помогу вам с любым вопросом.

Вот, что у меня можно найти:
1. Информацию о всех курсах
2. Информацию о стоимости курсов
3. Информация об оплате курсов
4. Часто задаваемые вопросы
5. Через меня можно связаться с менеджером

Выберите, интересующий вас, раздел из меню.
"""